/** ЗАДАЧА 4 - Объединение строк
 *
 * 1. Объявите три переменные с значениями:
 *  - ваше имя
 *  - ваша фамилия
 *  - ваша профессия
 *
 * 2. Создайте еще одну переменную. Ее значение должно быть, например
 * "Меня зовут <Имя> <Фамилия> и я <Профессия>"
 *
 * 3. Выведите значение последней переменной в консоль
 */
const yourName = 'Олег';
const yourSurname = 'Парамей';
const yourJob = 'Студент';
const info = `Меня зовут ${yourName} ${yourSurname} и я ${yourJob}`;
console.log(info);
console.log(yourJob);